B35doc/English/online/ehfug_C2/samples/WireAnnotation/ElectricalBundle1.xml

<SOAP_ENV:Envelope xmlns:NS1 = "CATIA/V5/Electrical/1.0" xmlns:NS2 = "http://www.ixfstd.org/std/ns/core/classBehaviors/links/1.0" xmlns:ixf = "http://www.ixfstd.org/std/ns/core/1.0" xmlns:tns = "IXF_Schema.xsd" xmlns:xsi = "http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP_ENV = "http://schemas.xmlsoap.org/soap/envelope/" xsi:schemaLocation = "IXF_Schema.xsd ElectricalSchema.xsd">
<SOAP_ENV:Body>

<ixf:object id = "Electrical Bundle1.1" xsi:type = "tns:Harness">
  <tns:Name>Electrical Bundle1.1</tns:Name>
</ixf:object>

<ixf:object id = "Wire1.1" xsi:type = "tns:Wire"><tns:Name>Wire1.1</tns:Name>
  <NS1:Wire>
    <NS1:OuterDiameter>0.005</NS1:OuterDiameter>
  </NS1:Wire>
  <NS1:Product>
    <NS1:PartNumber>Wire1</NS1:PartNumber>
  </NS1:Product>
</ixf:object>
<ixf:object id = "UID0" xsi:type = "tns:HarnessLink">
  <NS2:link>
    <NS2:object1 href = "#Electrical Bundle1.1"/>
    <NS2:object2 href = "#Wire1.1"/>
  </NS2:link>
</ixf:object>
<ixf:object id = "UID1" xsi:type = "tns:WireLink">
  <NS2:link>
    <NS2:object1 href = "#Connector_M.1"/>
    <NS2:object2 href = "#Wire1.1"/>
  </NS2:link>
</ixf:object>
<ixf:object id = "UID2" xsi:type = "tns:WireLink">
  <NS2:link>
    <NS2:object1 href = "#Connector_M.2"/>
    <NS2:object2 href = "#Wire1.1"/>
  </NS2:link>
</ixf:object>


<ixf:object id = "Wire2.1" xsi:type = "tns:Wire"><tns:Name>Wire2.1</tns:Name>
  <NS1:Wire>
    <NS1:OuterDiameter>0.005</NS1:OuterDiameter>
  </NS1:Wire>
  <NS1:Product>
    <NS1:PartNumber>Wire2</NS1:PartNumber>
  </NS1:Product>
</ixf:object>
<ixf:object id = "UID0" xsi:type = "tns:HarnessLink">
  <NS2:link>
    <NS2:object1 href = "#Electrical Bundle1.1"/>
    <NS2:object2 href = "#Wire2.1"/>
  </NS2:link>
</ixf:object>
<ixf:object id = "UID1" xsi:type = "tns:WireLink">
  <NS2:link>
    <NS2:object1 href = "#Connector_F.1"/>
    <NS2:object2 href = "#Wire2.1"/>
  </NS2:link>
</ixf:object>
<ixf:object id = "UID2" xsi:type = "tns:WireLink">
  <NS2:link>
    <NS2:object1 href = "#Connector_M.2"/>
    <NS2:object2 href = "#Wire2.1"/>
  </NS2:link>
</ixf:object>


<ixf:object id = "Wire3.1" xsi:type = "tns:Wire"><tns:Name>Wire3.1</tns:Name>
  <NS1:Wire>
    <NS1:OuterDiameter>0.005</NS1:OuterDiameter>
  </NS1:Wire>
  <NS1:Product>
    <NS1:PartNumber>Wire3</NS1:PartNumber>
  </NS1:Product>
</ixf:object>
<ixf:object id = "UID0" xsi:type = "tns:HarnessLink">
  <NS2:link>
    <NS2:object1 href = "#Electrical Bundle1.1"/>
    <NS2:object2 href = "#Wire3.1"/>
  </NS2:link>
</ixf:object>
<ixf:object id = "UID1" xsi:type = "tns:WireLink">
  <NS2:link>
    <NS2:object1 href = "#Connector_M.1"/>
    <NS2:object2 href = "#Wire3.1"/>
  </NS2:link>
</ixf:object>
<ixf:object id = "UID2" xsi:type = "tns:WireLink">
  <NS2:link>
    <NS2:object1 href = "#Connector_F.1"/>
    <NS2:object2 href = "#Wire3.1"/>
  </NS2:link>
</ixf:object>



<ixf:object id = "WireInGroupI1.1" xsi:type = "tns:Wire">
  <tns:Name>WireInGroupI1.1</tns:Name>
  <NS1:Wire>
    <NS1:OuterDiameter>0.003</NS1:OuterDiameter>
  </NS1:Wire>
  <NS1:Product>
    <NS1:PartNumber>WireInGroupI1</NS1:PartNumber>
  </NS1:Product>
</ixf:object>
<ixf:object id = "UID3" xsi:type = "tns:HarnessLink">
  <NS2:link>
    <NS2:object1 href = "#Electrical Bundle1.1"/>
    <NS2:object2 href = "#WireInGroupI1.1"/>
  </NS2:link>
</ixf:object>
<ixf:object id = "UID4" xsi:type = "tns:WireLink">
  <NS2:link>
    <NS2:object1 href = "#Connector_M.1"/>
    <NS2:object2 href = "#WireInGroupI1.1"/>
  </NS2:link>
</ixf:object>
<ixf:object id = "UID5" xsi:type = "tns:WireLink">
  <NS2:link>
    <NS2:object1 href = "#Connector_M.2"/>
    <NS2:object2 href = "#WireInGroupI1.1"/>
  </NS2:link>
</ixf:object>

<ixf:object id = "WireInGroupII1.1" xsi:type = "tns:Wire">
<tns:Name>WireInGroupII1.1</tns:Name>
  <NS1:Wire>
    <NS1:OuterDiameter>0.003</NS1:OuterDiameter>
  </NS1:Wire>
  <NS1:Product>
    <NS1:PartNumber>WireInGroupII1</NS1:PartNumber>
  </NS1:Product>
</ixf:object>
<ixf:object id = "UID3" xsi:type = "tns:HarnessLink">
  <NS2:link>
    <NS2:object1 href = "#Electrical Bundle1.1"/>
    <NS2:object2 href = "#WireInGroupII1.1"/>
  </NS2:link>
</ixf:object>
<ixf:object id = "UID4" xsi:type = "tns:WireLink">
  <NS2:link>
    <NS2:object1 href = "#Connector_M.2"/>
    <NS2:object2 href = "#WireInGroupII1.1"/>
  </NS2:link>
</ixf:object>
<ixf:object id = "UID5" xsi:type = "tns:WireLink">
  <NS2:link>
    <NS2:object1 href = "#Connector_F.1"/>
    <NS2:object2 href = "#WireInGroupII1.1"/>
  </NS2:link>
</ixf:object>


<ixf:object id = "WireInGroupIII1.1" xsi:type = "tns:Wire">
<tns:Name>WireInGroupIII1.1</tns:Name>
  <NS1:Wire>
    <NS1:OuterDiameter>0.003</NS1:OuterDiameter>
  </NS1:Wire>
  <NS1:Product>
    <NS1:PartNumber>WireInGroupIII1</NS1:PartNumber>
  </NS1:Product>
</ixf:object>
<ixf:object id = "UID3" xsi:type = "tns:HarnessLink">
  <NS2:link>
    <NS2:object1 href = "#Electrical Bundle1.1"/>
    <NS2:object2 href = "#WireInGroupIII1.1"/>
  </NS2:link>
</ixf:object>
<ixf:object id = "UID4" xsi:type = "tns:WireLink">
  <NS2:link>
    <NS2:object1 href = "#Connector_F.1"/>
    <NS2:object2 href = "#WireInGroupIII1.1"/>
  </NS2:link>
</ixf:object>
<ixf:object id = "UID5" xsi:type = "tns:WireLink">
  <NS2:link>
    <NS2:object1 href = "#Connector_M.1"/>
    <NS2:object2 href = "#WireInGroupIII1.1"/>
  </NS2:link>
</ixf:object>


<ixf:object id = "WireGroup1.1" xsi:type = "tns:WireGroup">
  <tns:Name>WireGroup1.1</tns:Name>
  <NS1:WireGroup/>
</ixf:object>

<ixf:object xsi:type="tns:WireGroupLink" id="Link_WireGroup1.1_WireInGroupI1.1">
  <NS2:link>
    <NS2:object1 href="#WireGroup1.1"/>
    <NS2:object2 href="#WireInGroupI1.1"/>
  </NS2:link>
</ixf:object>

<ixf:object id = "WireGroup2.1" xsi:type = "tns:WireGroup">
  <tns:Name>WireGroup2.1</tns:Name>
  <NS1:WireGroup/>
</ixf:object>

<ixf:object xsi:type="tns:WireGroupLink" id="Link_WireGroup2.1_WireInGroupII1.1">
  <NS2:link>
    <NS2:object1 href="#WireGroup2.1"/>
    <NS2:object2 href="#WireInGroupII1.1"/>
  </NS2:link>
</ixf:object>

<ixf:object id = "WireGroup3.1" xsi:type = "tns:WireGroup">
  <tns:Name>WireGroup3.1</tns:Name>
  <NS1:WireGroup/>
</ixf:object>

<ixf:object xsi:type="tns:WireGroupLink" id="Link_WireGroup1.1_WireInGroupIII1.1">
  <NS2:link>
    <NS2:object1 href="#WireGroup3.1"/>
    <NS2:object2 href="#WireInGroupIII1.1"/>
  </NS2:link>
</ixf:object>

<ixf:object id = "Connector_M.1" xsi:type = "tns:Connector">
  <tns:Name>Connector_M.1</tns:Name>
  <NS1:Connector/>
  <NS1:Product>
    <NS1:PartNumber>Connector_M</NS1:PartNumber>
  </NS1:Product>
</ixf:object>

<ixf:object id = "Connector_F.1" xsi:type = "tns:Connector">
  <tns:Name>Connector_F.1</tns:Name>
  <NS1:Connector/>
  <NS1:Product>
    <NS1:PartNumber>Connector_F</NS1:PartNumber>
  </NS1:Product>
</ixf:object>


<ixf:object id = "Connector_M.2" xsi:type = "tns:Connector">
  <tns:Name>Connector_M.2</tns:Name>
  <NS1:Connector/>
  <NS1:Product>
    <NS1:PartNumber>Connector_M</NS1:PartNumber>
  </NS1:Product>
</ixf:object>

</SOAP_ENV:Body>
</SOAP_ENV:Envelope>


